app/views/visitors/index.html.erb

SELECT "inspections".* FROM "inspections" WHERE "inspections"."user_id" = ?  [["user_id", 1]]
---
        <h3>Your Inspections</h3>
        <% @inspections = Inspection.where(user_id: current_user.id) %>