app/views/mechanics/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."mechanic_id" = ? LIMIT 1  [[nil, 1]]
---
        <div class="col-md-6">
          <h3 class="text-center">Name: <%=  mechanic.user.present? ? mechanic.user.name : "" %></h3>