app/controllers/inspections_controller.rb

SELECT  "inspections".* FROM "inspections" WHERE "inspections"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @inspections = Inspection.find(params[:id])

INSERT INTO "inspections" ("user_id", "location", "vehicle_year", "vehicle_make", "vehicle_model", "your_name", "your_address", "your_phone", "your_email", "seller_name", "seller_address", "seller_phone", "seller_email", "mechanics_id", "date", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @inspection = current_user.inspections.new(inspection_params)
    @inspection.mechanic = @mechanic

    respond_to do |format|
      if @inspection.valid?
        @btransaction = Braintree::Transaction.sale(amount: @inspection.mechanic.price,
                                                    credit_card: { number: inspection_params[:card_number],
                                                                   expiration_year: inspection_params[:card_year],
                                                                   expiration_month: inspection_params[:card_month],
                                                                   cvv: inspection_params[:cvv] },
                                                    customer: { first_name: inspection_params[:your_name],
                                                                email: inspection_params[:your_email] },
                                                    billing: { street_address: inspection_params[:your_address] },
                                                    options: { submit_for_settlement: true })

        if @btransaction.success?
            @inspection.braintree_id = @btransaction.transaction.id
            @inspection.save

SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_mechanic
      @mechanic   = Mechanic.find_by_id(params[:mechanic_id])