app/controllers/mechanics_controller.rb

SELECT "mechanics".* FROM "mechanics" WHERE "mechanics"."approved" = ?  ORDER BY created_at DESC  [["approved", "t"]]
SELECT "mechanics".* FROM "mechanics" WHERE (speciality LIKE '%test data%' OR zip LIKE '%test data%')
---
  def index
    @mechanics1 = Mechanic.where(approved: true).order("created_at DESC")
    @mechanics2 = Mechanic.where(approved: nil).order("created_at DESC")
    @mechanics = @mechanics1 + @mechanics2
    if params[:search]
     @mechanics = Mechanic.search(params[:search])

SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @mechanic = Mechanic.find(params[:id])

INSERT INTO "mechanics" ("bio", "kind", "company", "address", "city", "state", "zip", "speciality", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("name", "email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @mechanic = Mechanic.new params.require(:mechanic).permit(:bio, :kind, :company, :address, :city, :state, :zip, :speciality, :price, :picture)
    @user = User.new params[:mechanic].require(:user).permit(:name, :email, :password, :password_confirmation)
    @user.role = :mechanic
    @mechanic.approved = nil

    respond_to do |format|
      if @user.save

SELECT "mechanics".* FROM "mechanics" WHERE "mechanics"."approved" = ?  [["approved", "f"]]
---
  def unapproved
    authorize! :all, @mechanics
    @mechanics = Mechanic.where approved: false