app/views/inspections/show.html.erb

  <strong>Mechanic:</strong>
  <%= Mechanic.find(@inspection.mechanic_id).user.andand.name %>
---
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT 1  [["id", nil]]